In [9]:
import pandas as pd
import numpy as np

In [40]:
ards = pd.read_csv("/home/watercar99/project/MIMIC-III/ARDS.csv")
df = pd.read_csv("~/project/MIMIC-III/Data/FINAL/New_Demo+Lab/Demo_Lab(50%).csv")

In [41]:
df = df[["SUBJECT_ID", "HADM_ID", "DOA", "y"]]
df

      SUBJECT_ID  HADM_ID               DOA  y
0             91   121205  17 days 15:08:00  1
1            101   175533  15 days 18:41:00  1
2            111   192123               NaN  0
3            141   168006   3 days 09:29:00  1
4            148   199488               NaN  0
...          ...      ...               ... ..
5883       99881   172327   2 days 03:27:00  1
5884       99899   188409   9 days 01:34:00  1
5885       99912   189380               NaN  0
5886       99939   159023               NaN  0
5887       99985   176670               NaN  0

[5888 rows x 4 columns]

In [42]:
data = pd.read_csv("/data/project/noh/project/MIMIC-III/Data/OI&OSI/new_OI&OSI(down).csv")
df = pd.merge(df, data[["SUBJECT_ID", "HADM_ID"]], on=['SUBJECT_ID', 'HADM_ID'], how='inner')
df

      SUBJECT_ID  HADM_ID               DOA  y
0            101   175533  15 days 18:41:00  1
1            111   192123               NaN  0
2            141   168006   3 days 09:29:00  1
3            148   199488               NaN  0
4            170   175350               NaN  0
...          ...      ...               ... ..
2277       32763   160695  33 days 20:31:00  1
2278       32779   133757   6 days 14:39:00  1
2279       32781   142684               NaN  0
2280       32786   165351               NaN  0
2281       32800   179038               NaN  0

[2282 rows x 4 columns]

In [43]:
# 'DOA' 칼럼에서 'days' 앞에 있는 값을 추출하여 정수로 변환
df['DOA'] = df['DOA'].str.extract(r'(\d+) days').astype(float)

# 'y' 칼럼이 1이면서 'DOA' 값이 30 이하인 경우 'new_y'에 1을, 그렇지 않으면 0을 할당
df['new_y'] = df.apply(lambda row: 1 if (row['y'] == 1 and row['DOA'] <= 30) else 0, axis=1)

# 필요 없는 칼럼을 제거하고 결과 출력
df = df[['SUBJECT_ID', 'HADM_ID', 'DOA', 'y', 'new_y']]
df

      SUBJECT_ID  HADM_ID   DOA  y  new_y
0            101   175533  15.0  1      1
1            111   192123   NaN  0      0
2            141   168006   3.0  1      1
3            148   199488   NaN  0      0
4            170   175350   NaN  0      0
...          ...      ...   ... ..    ...
2277       32763   160695  33.0  1      0
2278       32779   133757   6.0  1      1
2279       32781   142684   NaN  0      0
2280       32786   165351   NaN  0      0
2281       32800   179038   NaN  0      0

[2282 rows x 5 columns]

In [47]:
# 'y_x'와 'y_y' 칼럼이 다른 경우만 필터링
different_y = df[df['y'] != df['new_y']]
different_y

# 'DOA' 열을 기준으로 오름차순으로 정렬
sorted_different_y = different_y.sort_values(by='DOA')
sorted_different_y

      SUBJECT_ID  HADM_ID    DOA  y  new_y
2117       29799   165367   31.0  1      0
2272       32686   175596   31.0  1      0
1074       14692   185051   31.0  1      0
1744       24432   198411   32.0  1      0
2277       32763   160695   33.0  1      0
1974       27642   133035   33.0  1      0
1962       27469   126534   33.0  1      0
1923       26979   161348   34.0  1      0
1965       27542   184604   35.0  1      0
1647       23190   172891   35.0  1      0
174         2452   166333   36.0  1      0
662         8952   161153   37.0  1      0
1109       15170   164648   39.0  1      0
1359       18791   179019   40.0  1      0
1832       25674   198147   41.0  1      0
357         4760   184259   41.0  1      0
720         9808   103248   41.0  1      0
787        10552   181627   42.0  1      0
710         9648   162025   42.0  1      0
1789       25003   138875   44.0  1      0
1569       21967   188171   45.0  1      0
697         9380   102438   45.0  1      0
369         4914   145788   46.0  1      0
2115       29769   179221   49.0  1      0
1992       27870   136095   50.0  1      0
1447       19856   131068   52.0  1      0
798        10695   161092   52.0  1      0
513         6873   186838   57.0  1      0
1900       26702   125308   58.0  1      0
915        12412   101380   58.0  1      0
1014       13806   184142   63.0  1      0
2129       30075   175900   63.0  1      0
825        11167   111095   64.0  1      0
279         3893   109500   64.0  1      0
2243       32154   187744   64.0  1      0
1950       27315   131643   69.0  1      0
1209       16565   196841   75.0  1      0
1038       14150   170248   86.0  1      0
816        11091   164694  102.0  1      0
2138       30202   117448  106.0  1      0
1986       27766   116756  127.0  1      0

In [31]:
data = pd.read_csv("/data/project/noh/project/MIMIC-III/Data/OI&OSI/new_OI&OSI(down).csv")
data = data[["SUBJECT_ID", "HADM_ID", "y"]]

      SUBJECT_ID  HADM_ID  y
0            101   175533  1
1            111   192123  0
2            141   168006  1
3            148   199488  0
4            170   175350  0
...          ...      ... ..
2277       32763   160695  1
2278       32779   133757  1
2279       32781   142684  0
2280       32786   165351  0
2281       32800   179038  0

[2282 rows x 3 columns]